tiborsimon/embedded-tdd-headers/pic/pic18/pic18f84j90_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F84J90_H_
#define _PIC18F84J90_H_

#define RCSTA2                        0
#define RCD82                         1
#define RX9D2                         2
#define RCSTA2_RCD8                   3
#define RCSTA2_RX9D                   4
#define RCSTA2_OERR                   5
#define OERR2                         6
#define FERR2                         7
#define RCSTA2_FERR                   8
#define ADDEN2                        9
#define RCSTA2_ADDEN                  10
#define RCSTA2_CREN                   11
#define CREN2                         12
#define SREN2                         13
#define RCSTA2_SREN                   14
#define RC92                          15
#define RCSTA2_nRC8                   16
#define RC8_92                        17
#define RCSTA2_RX9                    18
#define RCSTA2_NOT_RC8                19
#define RCSTA2_RC9                    20
#define RCSTA2_RC8_9                  21
#define RX92                          22
#define RCSTA2_SPEN                   23
#define SPEN2                         24
#define TXSTA2                        25
#define TXSTA2_TXD8                   26
#define TX9D2                         27
#define TXSTA2_TX9D                   28
#define TXD82                         29
#define TRMT2                         30
#define TXSTA2_TRMT                   31
#define BRGH2                         32
#define TXSTA2_BRGH                   33
#define SENDB2                        34
#define TXSTA2_SYNC                   35
#define SYNC2                         36
#define TXEN2                         37
#define TXSTA2_TXEN                   38
#define TX8_92                        39
#define TX92                          40
#define TXSTA2_TX9                    41
#define TXSTA2_nTX8                   42
#define TXSTA2_NOT_TX8                43
#define TXSTA2_TX8_9                  44
#define TXSTA2_CSRC                   45
#define CSRC2                         46
#define CCP2CON                       47
#define CCP2M                         48
#define CCP2M0                        49
#define CCP2M1                        50
#define CCP2M2                        51
#define CCP2M3                        52
#define DC2B0                         53
#define DCCP2Y                        54
#define DC2B                          55
#define DC2B1                         56
#define DCCP2X                        57
#define CCP1CON                       58
#define CCP1M0                        59
#define CCP1M                         60
#define CCP1M1                        61
#define CCP1M2                        62
#define CCP1M3                        63
#define DCCP1Y                        64
#define DC1B                          65
#define DC1B0                         66
#define DCCP1X                        67
#define DC1B1                         68
#define LCDDATA5                      69
#define S40C0                         70
#define SEG40COM0                     71
#define S40C15                        72
#define SEG41COM0                     73
#define S41C0                         74
#define S42C0                         75
#define SEG42COM0                     76
#define S43C0                         77
#define SEG43COM0                     78
#define SEG44COM0                     79
#define S44C0                         80
#define S45C0                         81
#define SEG45COM0                     82
#define S46C0                         83
#define SEG46COM0                     84
#define S47C0                         85
#define SEG47COM0                     86
#define SEG0COM1                      87
#define LCDDATA6                      88
#define S00C1                         89
#define S0C1                          90
#define S01C1                         91
#define SEG1COM1                      92
#define S1C1                          93
#define S02C1                         94
#define S2C1                          95
#define SEG2COM1                      96
#define S03C1                         97
#define SEG3COM1                      98
#define S3C1                          99
#define SEG4COM1                      100
#define S4C1                          101
#define S04C1                         102
#define S5C1                          103
#define S05C1                         104
#define SEG5COM1                      105
#define SEG6COM1                      106
#define S6C1                          107
#define S06C1                         108
#define SEG7COM1                      109
#define S7C1                          110
#define S07C1                         111
#define LCDDATA7                      112
#define S08C1                         113
#define S8C1                          114
#define SEG8COM1                      115
#define SEG9COM1                      116
#define S09C1                         117
#define S9C1                          118
#define S10C1                         119
#define SEG10COM1                     120
#define S11C1                         121
#define SEG11COM1                     122
#define S12C1                         123
#define SEG12COM1                     124
#define S13C1                         125
#define SEG13COM1                     126
#define S14C1                         127
#define SEG14COM1                     128
#define SEG15COM1                     129
#define S15C1                         130
#define SEG16COM1                     131
#define LCDDATA8                      132
#define S16C1                         133
#define SEG17COM1                     134
#define S17C1                         135
#define SEG18COM1                     136
#define S18C1                         137
#define S19C1                         138
#define SEG19COM1                     139
#define S20C1                         140
#define SEG20COM1                     141
#define S21C1                         142
#define SEG21COM1                     143
#define SEG22COM1                     144
#define S22C1                         145
#define S23C1                         146
#define SEG23COM1                     147
#define S24C1                         148
#define SEG24COM1                     149
#define LCDDATA9                      150
#define S25C1                         151
#define SEG25COM1                     152
#define S26C1                         153
#define SEG26COM1                     154
#define SEG27COM1                     155
#define S27C1                         156
#define SEG28COM1                     157
#define S28C1                         158
#define SEG29COM1                     159
#define S29C1                         160
#define SEG30COM1                     161
#define S30C1                         162
#define S31C1                         163
#define SEG31COM1                     164
#define S32C1                         165
#define LCDDATA10                     166
#define SEG32COM1                     167
#define SEG33COM1                     168
#define S33C1                         169
#define S34C1                         170
#define SEG34COM1                     171
#define S35C1                         172
#define SEG35COM1                     173
#define S36C1                         174
#define SEG36COM1                     175
#define SEG37COM1                     176
#define S37C1                         177
#define S38C1                         178
#define SEG38COM1                     179
#define SEG39COM1                     180
#define S39C1                         181
#define SEG40COM1                     182
#define S40C1                         183
#define LCDDATA11                     184
#define SEG41COM1                     185
#define S41C1                         186
#define LCDDATA11_ADMSK1              187
#define SEG42COM1                     188
#define S42C1                         189
#define LCDDATA11_ADMSK2              190
#define SEG43COM1                     191
#define LCDDATA11_ADMSK3              192
#define S43C1                         193
#define SEG44COM1                     194
#define LCDDATA11_ADMSK4              195
#define S44C1                         196
#define SEG45COM1                     197
#define LCDDATA11_ADMSK5              198
#define S45C1                         199
#define S46C1                         200
#define SEG46COM1                     201
#define S47C1                         202
#define SEG47COM1                     203
#define SEG0COM2                      204
#define SSPM012                       205
#define LCDDATA12                     206
#define S00C2                         207
#define S0C2                          208
#define S01C2                         209
#define SSPM112                       210
#define SEG1COM2                      211
#define S1C2                          212
#define S02C2                         213
#define S2C2                          214
#define SEG2COM2                      215
#define SSPM212                       216
#define S03C2                         217
#define SEG3COM2                      218
#define S3C2                          219
#define SSPM312                       220
#define SEG4COM2                      221
#define S4C2                          222
#define S04C2                         223
#define S5C2                          224
#define S05C2                         225
#define SEG5COM2                      226
#define SEG6COM2                      227
#define S6C2                          228
#define S06C2                         229
#define SEG7COM2                      230
#define S7C2                          231
#define S07C2                         232
#define LCDDATA13                     233
#define S08C2                         234
#define S8C2                          235
#define SEG8COM2                      236
#define SEG9COM2                      237
#define S09C2                         238
#define S9C2                          239
#define S10C2                         240
#define SEG10COM2                     241
#define SEG11COM2                     242
#define S11C2                         243
#define S12C2                         244
#define SEG12COM2                     245
#define S13C2                         246
#define SEG13COM2                     247
#define S14C2                         248
#define SEG14COM2                     249
#define S15C2                         250
#define SEG15COM2                     251
#define SEG16COM2                     252
#define S16C2                         253
#define LCDDATA14_MSK0                254
#define LCDDATA14                     255
#define S17C2                         256
#define LCDDATA14_MSK1                257
#define SEG17COM2                     258
#define LCDDATA14_MSK2                259
#define S18C2                         260
#define SEG18COM2                     261
#define S19C2                         262
#define SEG19COM2                     263
#define LCDDATA14_MSK3                264
#define LCDDATA14_MSK4                265
#define S20C2                         266
#define SEG20COM2                     267
#define LCDDATA14_MSK5                268
#define S21C2                         269
#define SEG21COM2                     270
#define SEG22COM2                     271
#define LCDDATA14_MSK6                272
#define S22C2                         273
#define LCDDATA14_MSK7                274
#define SEG23COM2                     275
#define S23C2                         276
#define LCDDATA15                     277
#define S24C2                         278
#define SEG24COM2                     279
#define S25C2                         280
#define SEG25COM2                     281
#define S26C2                         282
#define SEG26COM2                     283
#define SEG27COM2                     284
#define S27C2                         285
#define S28C2                         286
#define SEG28COM2                     287
#define SEG29COM2                     288
#define S29C2                         289
#define SEG30COM2                     290
#define S30C2                         291
#define SEG31COM2                     292
#define S31C2                         293
#define S32C2                         294
#define LCDDATA16                     295
#define SEG32COM2                     296
#define T4CKPS016                     297
#define T4CKPS116                     298
#define SEG33COM2                     299
#define S33C2                         300
#define S34C2                         301
#define SEG34COM2                     302
#define T4OUTPS016                    303
#define S35C2                         304
#define SEG35COM2                     305
#define T4OUTPS116                    306
#define SEG36COM2                     307
#define S36C2                         308
#define T4OUTPS216                    309
#define S37C2                         310
#define SEG37COM2                     311
#define SEG38COM2                     312
#define S38C2                         313
#define T4OUTPS316                    314
#define SEG39COM2                     315
#define S39C2                         316
#define LCDDATA17                     317
#define S40C2                         318
#define SEG40COM2                     319
#define SEG41COM2                     320
#define S41C2                         321
#define S42C2                         322
#define SEG42COM2                     323
#define S43C2                         324
#define SEG43COM2                     325
#define SEG44COM2                     326
#define S44C2                         327
#define S45C2                         328
#define SEG45COM2                     329
#define S46C2                         330
#define SEG46COM2                     331
#define S47C2                         332
#define SEG47COM2                     333
#define SEG0COM3                      334
#define LCDDATA18                     335
#define S00C3                         336
#define S0C3                          337
#define S01C3                         338
#define SEG1COM3                      339
#define S1C3                          340
#define S02C3                         341
#define S2C3                          342
#define SEG2COM3                      343
#define S03C3                         344
#define SEG3COM3                      345
#define S3C3                          346
#define SEG4COM3                      347
#define S4C3                          348
#define S04C3                         349
#define S5C3                          350
#define S05C3                         351
#define SEG5COM3                      352
#define SEG6COM3                      353
#define S6C3                          354
#define S06C3                         355
#define SEG7COM3                      356
#define S7C3                          357
#define S07C3                         358
#define S8C3                          359
#define SEG8COM3                      360
#define S08C3                         361
#define LCDDATA19                     362
#define S9C3                          363
#define SEG9COM3                      364
#define S09C3                         365
#define SEG10COM3                     366
#define S10C3                         367
#define S11C3                         368
#define SEG11COM3                     369
#define S12C3                         370
#define T3CKPS019                     371
#define SEG12COM3                     372
#define S13C3                         373
#define SEG13COM3                     374
#define T3CKPS119                     375
#define S14C3                         376
#define SEG14COM3                     377
#define TMR3CS019                     378
#define SEG15COM3                     379
#define S15C3                         380
#define TMR3CS119                     381
#define LCDDATA20                     382
#define S16C3                         383
#define SEG16COM3                     384
#define SEG17COM3                     385
#define S17C3                         386
#define SEG18COM3                     387
#define S18C3                         388
#define S19C3                         389
#define SEG19COM3                     390
#define S20C3                         391
#define SEG20COM3                     392
#define SEG21COM3                     393
#define S21C3                         394
#define SEG22COM3                     395
#define S22C3                         396
#define S23C3                         397
#define SEG23COM3                     398
#define S24C3                         399
#define LCDDATA21                     400
#define SEG24COM3                     401
#define S25C3                         402
#define SEG25COM3                     403
#define S26C3                         404
#define SEG26COM3                     405
#define SEG27COM3                     406
#define S27C3                         407
#define SEG28COM3                     408
#define S28C3                         409
#define SEG29COM3                     410
#define S29C3                         411
#define SEG30COM3                     412
#define S30C3                         413
#define SEG31COM3                     414
#define S31C3                         415
#define LCDDATA22                     416
#define S32C3                         417
#define SEG32COM3                     418
#define SEG33COM3                     419
#define S33C3                         420
#define S34C3                         421
#define SEG34COM3                     422
#define S35C3                         423
#define SEG35COM3                     424
#define S36C3                         425
#define SEG36COM3                     426
#define SEG37COM3                     427
#define S37C3                         428
#define S38C3                         429
#define SEG38COM3                     430
#define SEG39COM3                     431
#define S39C3                         432
#define LCDDATA23                     433
#define S40C3                         434
#define SEG40COM3                     435
#define SEG41COM3                     436
#define S41C3                         437
#define S42C3                         438
#define SEG42COM3                     439
#define SEG43COM3                     440
#define S43C3                         441
#define SEG44COM3                     442
#define S44C3                         443
#define S45C3                         444
#define SEG45COM3                     445
#define S46C3                         446
#define SEG46COM3                     447
#define S47C3                         448
#define SEG47COM3                     449
#define BAUDCON1                      450
#define ABDEN                         451
#define ABDEN1                        452
#define WUE1                          453
#define WUE                           454
#define BRG16                         455
#define BRG161                        456
#define TXCKP                         457
#define SCKP                          458
#define TXCKP1                        459
#define SCKP1                         460
#define CKTXP                         461
#define DTRXP1                        462
#define RXDTP1                        463
#define RXDTP                         464
#define DTRXP                         465
#define RCIDL1                        466
#define RCMT                          467
#define RCMT1                         468
#define RCIDL                         469
#define ABDOVF                        470
#define ABDOVF1                       471
#define PORTA                         472
#define AN0                           473
#define ULPWUIN                       474
#define PORTA_RA0                     475
#define SEG18                         476
#define AN1                           477
#define PORTA_RA1                     478
#define AN2                           479
#define PORTA_RA2                     480
#define VREFM                         481
#define AN3                           482
#define PORTA_RA3                     483
#define VREFP                         484
#define PORTA_RA4                     485
#define SEG14                         486
#define T0CKI                         487
#define SEG15                         488
#define AN4                           489
#define PORTA_RA5                     490
#define LVDIN                         491
#define CLKO                          492
#define PORTA_RA6                     493
#define OSC2                          494
#define CLKI                          495
#define PORTA_RA7                     496
#define OSC1                          497
#define PORTA_RJPU                    498
#define PORTB                         499
#define SEG30                         500
#define INT0                          501
#define PORTB_RB0                     502
#define INT1                          503
#define SEG8                          504
#define PORTB_RB1                     505
#define INT2                          506
#define SEG9                          507
#define PORTB_RB2                     508
#define SEG10                         509
#define INT3                          510
#define CCP2_PA2                      511
#define PORTB_RB3                     512
#define SEG11                         513
#define KBI0                          514
#define PORTB_RB4                     515
#define SEG29                         516
#define KBI1                          517
#define PORTB_RB5                     518
#define PGC                           519
#define KBI2                          520
#define PORTB_RB6                     521
