tiborsimon/embedded-tdd-headers/pic/pic18/pic18f84j90_tdd.h
#define WERR                          1091
#define LCDWERR                       1092
#define LCDSLPEN                      1093
#define SLPEN                         1094
#define LCDEN                         1095
#define LCDSE0                        1096
#define SE0                           1097
#define SEGEN0                        1098
#define SE00                          1099
#define SE1                           1100
#define SEGEN1                        1101
#define SE01                          1102
#define SE2                           1103
#define SEGEN2                        1104
#define SE02                          1105
#define SE3                           1106
#define SEGEN3                        1107
#define SE03                          1108
#define SE4                           1109
#define SEGEN4                        1110
#define SE04                          1111
#define SE5                           1112
#define SE05                          1113
#define SEGEN5                        1114
#define SE6                           1115
#define SE06                          1116
#define SEGEN6                        1117
#define SE07                          1118
#define SE7                           1119
#define SEGEN7                        1120
#define LCDPS                         1121
#define LP                            1122
#define LP0                           1123
#define LCDPS0                        1124
#define LP1                           1125
#define LCDPS1                        1126
#define LP2                           1127
#define LCDPS2                        1128
#define LP3                           1129
#define LCDPS3                        1130
#define WA                            1131
#define LCDA                          1132
#define BIASMD                        1133
#define WFT                           1134
#define RCSTA1                        1135
#define RCSTA1_RX9D                   1136
#define RX9D1                         1137
#define RCSTA1_RCD8                   1138
#define RCSTA1_OERR                   1139
#define OERR1                         1140
#define RCSTA1_FERR                   1141
#define FERR1                         1142
#define RCSTA1_ADDEN                  1143
#define ADDEN1                        1144
#define RCSTA1_CREN                   1145
#define CREN1                         1146
#define SRENA                         1147
#define SREN1                         1148
#define RCSTA1_SREN                   1149
#define RCSTA1_NOT_RC8                1150
#define RCSTA1_RC9                    1151
#define RCSTA1_nRC8                   1152
#define RCSTA1_RC8_9                  1153
#define RCSTA1_RX9                    1154
#define RX91                          1155
#define RCSTA1_SPEN                   1156
#define SPEN1                         1157
#define TXSTA1                        1158
#define TX9D1                         1159
#define TXSTA1_TX9D                   1160
#define TXSTA1_TXD8                   1161
#define TRMT1                         1162
#define TXSTA1_TRMT                   1163
#define BRGH1                         1164
#define TXSTA1_BRGH                   1165
#define SENDB1                        1166
#define SENDB                         1167
#define TXSTA1_SYNC                   1168
#define SYNC1                         1169
#define TXEN1                         1170
#define TXSTA1_TXEN                   1171
#define TX91                          1172
#define TXSTA1_NOT_TX8                1173
#define TXSTA1_TX8_9                  1174
#define TXSTA1_TX9                    1175
#define TXSTA1_nTX8                   1176
#define TXSTA1_CSRC                   1177
#define CSRC1                         1178
#define T3CON                         1179
#define TMR3ON                        1180
#define TMR3CS                        1181
#define nT3SYNC                       1182
#define NOT_T3SYNC                    1183
#define T3SYNC                        1184
#define T3INSYNC                      1185
#define SOSCEN3                       1186
#define T3CCP1                        1187
#define T3CKPS                        1188
#define T3CKPS0                       1189
#define T3CKPS1                       1190
#define T3CCP2                        1191
#define T3CON_RD16                    1192
#define RD163                         1193
#define T3RD16                        1194
#define CMCON                         1195
#define CMEN0                         1196
#define CMCON_CM                      1197
#define CM0                           1198
#define CMEN1                         1199
#define CM1                           1200
#define CMEN2                         1201
#define CM2                           1202
#define CIS                           1203
#define C1INV                         1204
#define C2INV                         1205
#define CMCON_C1OUT                   1206
#define CMCON_C2OUT                   1207
#define CVRCON                        1208
#define CVR                           1209
#define CVR0                          1210
#define CVR1                          1211
#define CVR2                          1212
#define CVR3                          1213
#define CVRSS                         1214
#define CVRR                          1215
#define CVROEN                        1216
#define CVROE                         1217
#define CVREN                         1218
#define SE08                          1219
#define SE8                           1220
#define SEGEN8                        1221
#define LCDSE1                        1222
#define SEGEN9                        1223
#define SE09                          1224
#define SE9                           1225
#define SEGEN10                       1226
#define SE10                          1227
#define SEGEN11                       1228
#define SE11                          1229
#define SEGEN12                       1230
#define SE12                          1231
#define SEGEN13                       1232
#define SE13                          1233
#define SEGEN14                       1234
#define SE14                          1235
#define SEGEN15                       1236
#define SE15                          1237
#define SEGEN16                       1238
#define LCDSE2                        1239
#define SE16                          1240
#define SEGEN17                       1241
#define SE17                          1242
#define SEGEN18                       1243
#define SE18                          1244
#define SEGEN19                       1245
#define SE19                          1246
#define SE20                          1247
#define SEGEN20                       1248
#define SE21                          1249
#define SEGEN21                       1250
#define SEGEN22                       1251
#define SE22                          1252
#define SEGEN23                       1253
#define SE23                          1254
#define SE24                          1255
#define SEGEN24                       1256
#define LCDSE3                        1257
#define SE25                          1258
#define SEGEN25                       1259
#define SE26                          1260
#define SEGEN26                       1261
#define SE27                          1262
#define SEGEN27                       1263
#define SE28                          1264
#define SEGEN28                       1265
#define SEGEN29                       1266
#define SE29                          1267
#define SE30                          1268
#define SEGEN30                       1269
#define SEGEN31                       1270
#define SE31                          1271
#define SE32                          1272
#define SEGEN32                       1273
#define LCDSE4                        1274
#define SE33                          1275
#define SEGEN33                       1276
#define SE34                          1277
#define SEGEN34                       1278
#define SE35                          1279
#define SEGEN35                       1280
#define SE36                          1281
#define SEGEN36                       1282
#define SE37                          1283
#define SEGEN37                       1284
#define SE38                          1285
#define SEGEN38                       1286
#define SE39                          1287
#define SEGEN39                       1288
#define SE40                          1289
#define SEGEN40                       1290
#define LCDSE5                        1291
#define SE41                          1292
#define SEGEN41                       1293
#define SE42                          1294
#define SEGEN42                       1295
#define SE43                          1296
#define SEGEN43                       1297
#define SE44                          1298
#define SEGEN44                       1299
#define SEGEN45                       1300
#define SE45                          1301
#define SE46                          1302
#define SEGEN46                       1303
#define SE47                          1304
#define SEGEN47                       1305
#define SEG0COM0                      1306
#define LCDDATA0                      1307
#define S00C0                         1308
#define S0C0                          1309
#define S01C0                         1310
#define SEG1COM0                      1311
#define S1C0                          1312
#define S02C0                         1313
#define S2C0                          1314
#define SEG2COM0                      1315
#define S03C0                         1316
#define SEG3COM0                      1317
#define S3C0                          1318
#define SEG4COM0                      1319
#define S4C0                          1320
#define S04C0                         1321
#define S5C0                          1322
#define S05C0                         1323
#define SEG5COM0                      1324
#define SEG6COM0                      1325
#define S6C0                          1326
#define S06C0                         1327
#define SEG7COM0                      1328
#define S7C0                          1329
#define S07C0                         1330
#define S08C0                         1331
#define LCDDATA1                      1332
#define S8C0                          1333
#define SEG8COM0                      1334
#define SEG9COM0                      1335
#define S09C0                         1336
#define S9C0                          1337
#define S10C0                         1338
#define SEG10COM0                     1339
#define S11C0                         1340
#define SEG11COM0                     1341
#define S12C0                         1342
#define SEG12COM0                     1343
#define S13C0                         1344
#define SEG13COM0                     1345
#define S14C0                         1346
#define SEG14COM0                     1347
#define SEG15COM0                     1348
#define S15C0                         1349
#define LCDDATA2                      1350
#define S16C0                         1351
#define SEG16COM0                     1352
#define SEG17COM0                     1353
#define S17C0                         1354
#define SEG18COM0                     1355
#define S18C0                         1356
#define S19C0                         1357
#define SEG19COM0                     1358
#define S20C0                         1359
#define SEG20COM0                     1360
#define S21C0                         1361
#define SEG21COM0                     1362
#define SEG22COM0                     1363
#define S22C0                         1364
#define S23C0                         1365
#define SEG23COM0                     1366
#define LCDDATA3                      1367
#define S24C0                         1368
#define SEG24COM0                     1369
#define S25C0                         1370
#define SEG25COM0                     1371
#define S26C0                         1372
#define SEG26COM0                     1373
#define SEG27COM0                     1374
#define S27C0                         1375
#define SEG28COM0                     1376
#define S28C0                         1377
#define SEG29COM0                     1378
#define S29C0                         1379
#define S30C0                         1380
#define SEG30COM0                     1381
#define SEG31COM0                     1382
#define S31C0                         1383
#define S32C0                         1384
#define LCDDATA4                      1385
#define SEG32COM0                     1386
#define SEG33COM0                     1387
#define S33C0                         1388
#define S34C0                         1389
#define SEG34COM0                     1390
#define S35C0                         1391
#define SEG35COM0                     1392
#define S36C0                         1393
#define SEG36COM0                     1394
#define SEG37COM0                     1395
#define S37C0                         1396
#define S38C0                         1397
#define SEG38COM0                     1398
#define SEG39COM0                     1399
#define S39C0                         1400
#define ADCON2                        1401
#define ADCS0                         1402
#define ADCS                          1403
#define ADCS1                         1404
#define ADCS2                         1405
#define ACQT0                         1406
#define ACQT                          1407
#define ACQT1                         1408
#define ACQT2                         1409
#define ADFM                          1410
#define ADCON1                        1411
#define PCFG0                         1412
#define PCFG                          1413
#define PCFG1                         1414
#define PCFG2                         1415
#define CHSN3                         1416
#define PCFG3                         1417
#define VCFG                          1418
#define VCFG0                         1419
#define VCFG01                        1420
#define VCFG11                        1421
#define VCFG1                         1422
#define ADCON0                        1423
#define ADON                          1424
#define nDONE                         1425
#define GO_nDONE                      1426
#define NOT_DONE                      1427
#define GODONE                        1428
#define GO_DONE                       1429
#define DONE                          1430
#define GO                            1431
#define GO_NOT_DONE                   1432
#define CHS                           1433
#define CHS0                          1434
#define CHS1                          1435
#define CHS2                          1436
#define CHS3                          1437
#define ADCAL                         1438
#define SSPCON2                       1439
#define SEN1                          1440
#define SEN                           1441
#define ADMSK11                       1442
#define SSPCON2_ADMSK1                1443
#define RSEN1                         1444
#define RSEN                          1445
#define PEN                           1446
#define SSPCON2_ADMSK2                1447
#define ADMSK21                       1448
#define PEN1                          1449
#define ADMSK31                       1450
#define RCEN                          1451
#define SSPCON2_ADMSK3                1452
#define RCEN1                         1453
#define SSPCON2_ADMSK4                1454
#define ACKEN                         1455
#define ACKEN1                        1456
#define ADMSK41                       1457
#define ACKDT1                        1458
#define ADMSK51                       1459
#define SSPCON2_ADMSK5                1460
#define ACKDT                         1461
#define ACKSTAT                       1462
#define ACKSTAT1                      1463
#define GCEN                          1464
#define GCEN1                         1465
#define SSPCON1                       1466
#define SSPM0                         1467
#define SSPM                          1468
#define SSPM01                        1469
#define SSPM1                         1470
#define SSPM11                        1471
#define SSPM2                         1472
#define SSPM21                        1473
#define SSPM31                        1474
#define SSPM3                         1475
#define CKP                           1476
#define CKP1                          1477
#define SSPEN                         1478
#define SSPEN1                        1479
#define SSPOV1                        1480
#define SSPOV                         1481
#define WCOL1                         1482
#define WCOL                          1483
#define SSPSTAT                       1484
#define BF                            1485
#define BF1                           1486
#define UA1                           1487
#define UA                            1488
#define R_NOT_W                       1489
#define READ_WRITE                    1490
#define RW1                           1491
#define NOT_W                         1492
#define I2C_READ                      1493
#define nW                            1494
#define RW                            1495
#define nWRITE                        1496
#define R                             1497
#define NOT_WRITE                     1498
#define R_nW                          1499
#define R_W                           1500
#define START                         1501
#define START1                        1502
#define S                             1503
#define I2C_START                     1504
#define STOP                          1505
#define STOP1                         1506
#define I2C_STOP                      1507
#define P                             1508
#define NOT_A                         1509
#define nA                            1510
#define D_A                           1511
#define D_nA                          1512
#define D                             1513
#define DA1                           1514
#define DA                            1515
#define DATA_ADDRESS                  1516
#define D_NOT_A                       1517
#define NOT_ADDRESS                   1518
#define nADDRESS                      1519
#define I2C_DAT                       1520
#define CKE                           1521
#define CKE1                          1522
#define SMP                           1523
#define SMP1                          1524
#define SSPADD                        1525
#define SSPADD_MSK0                   1526
#define MSK01                         1527
#define MSK11                         1528
#define SSPADD_MSK1                   1529
#define MSK21                         1530
#define SSPADD_MSK2                   1531
#define MSK31                         1532
#define SSPADD_MSK3                   1533
#define SSPADD_MSK4                   1534
#define MSK41                         1535
#define MSK51                         1536
#define SSPADD_MSK5                   1537
#define SSPADD_MSK6                   1538
#define MSK61                         1539
#define MSK71                         1540
#define SSPADD_MSK7                   1541
#define T2CON                         1542
#define T2CKPS0                       1543
#define T2CKPS                        1544
#define T2CKPS1                       1545
#define TMR2ON                        1546
#define T2OUTPS0                      1547
#define T2OUTPS                       1548
#define T2OUTPS1                      1549
#define T2OUTPS2                      1550
#define T2OUTPS3                      1551
#define PR2                           1552
#define WM0                           1553
#define WM1                           1554
#define WAIT0                         1555
#define WAIT1                         1556
#define EBDIS                         1557
#define T1CON                         1558
#define TMR1ON                        1559
#define TMR1CS                        1560
#define NOT_T1SYNC                    1561
#define T1SYNC                        1562
#define nT1SYNC                       1563
#define T1INSYNC                      1564
#define T1OSCEN                       1565
#define SOSCEN                        1566
#define T1CKPS0                       1567
#define T1CKPS                        1568
#define T1CKPS1                       1569
#define T1RUN                         1570
#define T1RD16                        1571
#define T1CON_RD16                    1572
#define RCON                          1573
#define BOR                           1574
#define NOT_BOR                       1575
#define nBOR                          1576
#define POR                           1577
#define nPOR                          1578
#define NOT_POR                       1579
#define PD                            1580
#define nPD                           1581
#define NOT_PD                        1582
#define nTO                           1583
#define TO                            1584
#define NOT_TO                        1585
#define nRI                           1586
#define NOT_RI                        1587
#define RI                            1588
#define NOT_CM                        1589
#define RCON_CM                       1590
#define nCM                           1591
#define IPEN                          1592
#define WDTCON                        1593
#define SWDTE                         1594
#define SWDTEN                        1595
#define REGSLP                        1596
#define LCDREG                        1597
#define CKSEL0                        1598
#define CKSEL1                        1599
#define MODE13                        1600
#define BIAS0                         1601
#define BIAS1                         1602
#define BIAS2                         1603
#define CPEN                          1604
#define OSCCON                        1605
#define SCS0                          1606
#define SCS                           1607
#define SCS1                          1608
#define IOFS                          1609
#define OSTS                          1610
#define IRCF                          1611
#define IRCF0                         1612
#define IRCF1                         1613
#define IRCF2                         1614
#define IDLEN                         1615
#define T0CON                         1616
#define T0PS                          1617
#define T0PS0                         1618
#define T0PS1                         1619
#define T0PS2                         1620
#define PSA                           1621
#define T0PS3                         1622
#define T0SE                          1623
#define T0CS                          1624
#define T08BIT                        1625
#define TMR0ON                        1626
#define STATUS                        1627
#define C                             1628
#define CARRY                         1629
#define DC                            1630
#define ZERO                          1631
#define Z                             1632
#define OV                            1633
#define OVERFLOW                      1634
#define N                             1635
#define NEGATIVE                      1636
#define INTCON3                       1637
#define INT1IF                        1638
#define INT1F                         1639
#define INT2IF                        1640
#define INT2F                         1641
#define INT3F                         1642
#define INT3IF                        1643
#define INT1E                         1644
#define INT1IE                        1645
#define INT2IE                        1646
#define INT2E                         1647
#define INT3E                         1648
