tiborsimon/embedded-tdd-headers/pic/pic18/pic18f84j90_tdd.h
#define INT3IE                        1649
#define INT1P                         1650
#define INT1IP                        1651
#define INT2IP                        1652
#define INT2P                         1653
#define INTCON2                       1654
#define RBIP                          1655
#define INT3IP                        1656
#define INT3P                         1657
#define TMR0IP                        1658
#define T0IP                          1659
#define INTEDG3                       1660
#define INTEDG2                       1661
#define INTEDG1                       1662
#define INTEDG0                       1663
#define RBPU                          1664
#define NOT_RBPU                      1665
#define nRBPU                         1666
#define INTCON                        1667
#define RBIF                          1668
#define INT0F                         1669
#define INT0IF                        1670
#define T0IF                          1671
#define TMR0IF                        1672
#define RBIE                          1673
#define INT0E                         1674
#define INT0IE                        1675
#define T0IE                          1676
#define TMR0IE                        1677
#define PEIE                          1678
#define PEIE_GIEL                     1679
#define GIEL                          1680
#define GIE_GIEH                      1681
#define GIE                           1682
#define GIEH                          1683
#define SP0                           1684
#define STKPTR                        1685
#define STKPTR0                       1686
#define SP1                           1687
#define STKPTR1                       1688
#define STKPTR2                       1689
#define SP2                           1690
#define SP3                           1691
#define STKPTR3                       1692
#define STKPTR4                       1693
#define SP4                           1694
#define STKUNF                        1695
#define STKOVF                        1696
#define STKFUL                        1697

#endif // _PIC18F84J90_H_
